# Brewfile — managed via Claude Code
# Run: brew bundle --file=~/dotfiles/Brewfile

# --- Core CLI tools ---
brew "git"              # newer than macOS system git
brew "gh"               # GitHub CLI
brew "gnupg"            # PGP key management and git commit signing

# --- Secrets management ---
cask "1password"        # 1Password desktop app
cask "1password-cli"    # 1Password CLI (op)

# --- Languages & runtimes ---
brew "node"             # TypeScript/Node.js
brew "go"               # Go
brew "rustup"           # Rust toolchain installer
brew "python@3"         # Python 3

# --- Cloud & infra ---
brew "awscli"           # AWS CLI
brew "terraform"        # Infrastructure as code
brew "kubectl"          # Kubernetes CLI

# --- Containers ---
cask "docker-desktop"   # Docker Desktop (includes docker CLI + Docker Engine)

# --- Editors ---
cask "visual-studio-code"

# --- Browsers ---
cask "google-chrome"

# --- Networking ---
# Tailscale installed via App Store (required for macOS integration)
